'''
Задача 1:
Напишете програма, която въвежда от клавиатурата страна и височина към нея на триъгълник,
изчислява лицето му и извежда подходящо съобщение с резултата.
Тествайте програмата със стойности 2.5 и 4.0 за страната и височината. 

Изготвил решението: Ниагара Георгиева Фак. №: 223010012
24.06.2023г.
'''

a = float(input("Enter the lenght of a side of a triangle: "))              #Приемаме входните данни за страната.
ha = float(input("Enter the lenght of the height from that side: "))        #Премаме входните данни за височината.
S = a * ha / 2                                                              #Изчисляваме лицето.
print("The area of this triangle is:",S)                                    #Извеждаме резултата.